üìñ Ï∞∏Í≥†, Îç∞Ïù¥ÌÑ∞ : Do it! Îç∞Ïù¥ÌÑ∞ Î∂ÑÏÑùÏùÑ ÏúÑÌïú ÌåêÎã§Ïä§ ÏûÖÎ¨∏

# Îç∞Ïù¥ÌÑ∞ Ïó∞Í≤∞ÌïòÍ∏∞

### concat()ÏúºÎ°ú Ïó∞Í≤∞ÌïòÍ∏∞

In [2]:
import pandas as pd

In [3]:
df1 = pd.read_csv('data/concat_1.csv') 
df2 = pd.read_csv('data/concat_2.csv') 
df3 = pd.read_csv('data/concat_3.csv')

In [4]:
df1.head()

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [4]:
df2.head()

    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [5]:
df3.head()

     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

- concat()ÏùÄ Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùÑ Ïó∞Í≤∞Ìï† Îïå ÏúÑÏóêÏÑú ÏïÑÎûò Î∞©Ìñ•ÏúºÎ°ú Ïó∞Í≤∞Ìï®

In [6]:
row_concat = pd.concat([df1, df2, df3]) 
row_concat

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [7]:
row_concat.iloc[7, ]

A    a7
B    b7
C    c7
D    d7
Name: 3, dtype: object

### Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóê ÏãúÎ¶¨Ï¶à Ïó∞Í≤∞ÌïòÍ∏∞

In [8]:
new_row_series = pd.Series(['n1', 'n2', 'n3', 'n4'])

In [9]:
pd.concat([df1, new_row_series])

     A    B    C    D    0
0   a0   b0   c0   d0  NaN
1   a1   b1   c1   d1  NaN
2   a2   b2   c2   d2  NaN
3   a3   b3   c3   d3  NaN
0  NaN  NaN  NaN  NaN   n1
1  NaN  NaN  NaN  NaN   n2
2  NaN  NaN  NaN  NaN   n3
3  NaN  NaN  NaN  NaN   n4

- NaN : ÎàÑÎùΩÍ∞í

- ÏãúÎ¶¨Ï¶àÎ•º Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò ÏÉàÎ°úÏö¥ ÌñâÏúºÎ°ú Ïó∞Í≤∞ÌïòÎ†§Î©¥ Ïó¥ Ïù¥Î¶ÑÏù¥ ÌïÑÏöîÌï®

In [10]:
new_row_df = pd.DataFrame([['n1', 'n2', 'n3', 'n4']], columns=['A', 'B', 'C', 'D']) 
new_row_df

    A   B   C   D
0  n1  n2  n3  n4

In [11]:
print(pd.concat([df1, new_row_df]))

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4

- concat()ÏùÄ Ìïú Î≤àÏóê 2Í∞ú Ïù¥ÏÉÅÏùò Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùÑ Ïó∞Í≤∞Ìï† Ïàò ÏûàÎäî Î©îÏÑúÎìú
- Ïó∞Í≤∞Ìïú Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏù¥ 1Í∞úÎùºÎ©¥ append Î©îÏÑúÎìú ÏÇ¨Ïö© o

In [12]:
print(df1.append(new_row_df))

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4

In [13]:
data_dict = {'A': 'n1', 'B': 'n2', 'C': 'n3', 'D': 'n4'}
print(df1.append(data_dict, ignore_index=True))

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  n1  n2  n3  n4

### Îã§ÏñëÌïú Î∞©Î≤ïÏúºÎ°ú Îç∞Ïù¥ÌÑ∞ Ïó∞Í≤∞ÌïòÍ∏∞

In [14]:
row_concat_i = pd.concat([df1, df2, df3], ignore_index=True) 
print(row_concat_i)

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [15]:
col_concat = pd.concat([df1, df2, df3], axis=1) 
print(col_concat)

    A   B   C   D   A   B   C   D    A    B    C    D
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

In [16]:
print(col_concat['A'])

    A   A    A
0  a0  a4   a8
1  a1  a5   a9
2  a2  a6  a10
3  a3  a7  a11

- Î≥¥ÌÜµ ÎßéÏù¥ Ïì∞Îäî Î∞©Î≤ï

In [17]:
col_concat['new_col_list'] = ['n1', 'n2', 'n3', 'n4'] 
print(col_concat)

    A   B   C   D   A   B   C   D    A    B    C    D new_col_list
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8           n1
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9           n2
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10           n3
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11           n4

In [18]:
print(pd.concat([df1, df2, df3], axis=1, ignore_index=True))

   0   1   2   3   4   5   6   7    8    9    10   11
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

# merge() ÏÇ¨Ïö©ÌïòÍ∏∞

In [19]:
person = pd.read_csv('data/survey_person.csv') 
site = pd.read_csv('data/survey_site.csv') 
survey = pd.read_csv('data/survey_survey.csv') 
visited = pd.read_csv('data/survey_visited.csv')

In [20]:
person.head(3)

  ident  personal   family
0  dyer   William     Dyer
1    pb     Frank  Pabodie
2  lake  Anderson     Lake

In [21]:
site.head(3)

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [22]:
survey.head(3)

   taken person quant  reading
0    619   dyer   rad     9.82
1    619   dyer   sal     0.13
2    622   dyer   rad     7.80

In [23]:
visited.head(3)

   ident  site       dated
0    619  DR-1  1927-02-08
1    622  DR-1  1927-02-10
2    734  DR-3  1939-01-07

In [24]:
visited_subset = visited.loc[[0, 2, 6], ]

- merge() : Í∏∞Î≥∏Ï†ÅÏúºÎ°ú ÎÇ¥Î∂Ä Ï°∞Ïù∏(Îëò Ïù¥ÏÉÅÏùò dfÏóêÏÑú Ï°∞Í±¥Ïóê ÎßûÎäî ÌñâÏùÑ Ïó∞Í≤∞ÌïòÎäî Í≤É)

In [25]:
o2o_merge = site.merge(visited_subset, left_on='name', right_on='site') 
print(o2o_merge)

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
2  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

In [26]:
m2o_merge = site.merge(visited, left_on='name', right_on='site') 
print(m2o_merge)

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-1 -49.85 -128.57    622   DR-1  1927-02-10
2   DR-1 -49.85 -128.57    844   DR-1  1932-03-22
3   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
4   DR-3 -47.15 -126.72    735   DR-3  1930-01-12
5   DR-3 -47.15 -126.72    751   DR-3  1930-02-26
6   DR-3 -47.15 -126.72    752   DR-3         NaN
7  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

In [27]:
ps = person.merge(survey, left_on='ident', right_on='person') 
vs = visited.merge(survey, left_on='ident', right_on='taken')

print(ps)

   ident   personal   family  taken person quant  reading
0   dyer    William     Dyer    619   dyer   rad     9.82
1   dyer    William     Dyer    619   dyer   sal     0.13
2   dyer    William     Dyer    622   dyer   rad     7.80
3   dyer    William     Dyer    622   dyer   sal     0.09
4     pb      Frank  Pabodie    734     pb   rad     8.41
5     pb      Frank  Pabodie    734     pb  temp   -21.50
6     pb      Frank  Pabodie    735     pb   rad     7.22
7     pb      Frank  Pabodie    751     pb   rad     4.35
8     pb      Frank  Pabodie    751     pb  temp   -18.50
9   lake   Anderson     Lake    734   lake   sal     0.05
10  lake   Anderson     Lake    751   lake   sal     0.10
11  lake   Anderson     Lake    752   lake   rad     2.19
12  lake   Anderson     Lake    752   lake   sal     0.09
13  lake   Anderson     Lake    752   lake  temp   -16.00
14  lake   Anderson     Lake    837   lake   rad     1.46
15  lake   Anderson     Lake    837   lake   sal     0.21
16   roe  Valentina  Roerich    752    roe   sal    41.60
17   roe  Valentina  Roerich    837    roe   sal    22.50
18   roe  Valentina  Roerich    844    roe   rad    11.25